inst/theory/breakpoint.org
#+TITLE: Breakpoint model
#+Author: 

* Single breakpoint, single slope

** Theory

Consider a response variable \(Y\) and an explanatory variable \(X\)
related by:
#+BEGIN_EXPORT latex
\begin{align*}
Y = \beta X - \beta (X - \psi)_+ + \varepsilon
\end{align*}
#+END_EXPORT

\noindent where \((\beta,\psi) \in \Real^2\), \(\varepsilon
\sim \Gaus[0,\sigma^2]\), and \((x)_+=x\) if \(x>0\) and 0
otherwise. Introduce \(\Theta = (\beta,\psi,\sigma^2)\), we can
express the likelihood relative to \(n\) iid observations as:
#+BEGIN_EXPORT latex
\begin{align*}
\Likelihood(\Theta) = \prod_{i=1}^n \frac{1}{\sqrt{2\pi\sigma^2}}\exp\left(-\frac{(Y_i - \beta X_i + \beta (X_i - \psi)_+)^2}{2\sigma^2}\right)
\end{align*}
#+END_EXPORT
and the log-likelihood as:
#+BEGIN_EXPORT latex
\begin{align*}
\likelihood(\Theta) = - \frac{n}{2} \log(2\pi) - \frac{n}{2} \log(\sigma^2) - \sum_{i=1}^n \frac{\left(Y_i - \beta X_i + \beta (X_i - \psi)_+\right)^2}{2\sigma^2}
\end{align*}
#+END_EXPORT

\noindent Maximizing the likelihood with respect to \(\Theta_\mu =
(\beta,\psi)\) is equivalent to minimizing the mean squared
error:
#+BEGIN_EXPORT latex
\begin{align*}
\likelihood(\Theta_\mu) = \sum_{i=1}^n (Y_i - \beta X_i + \beta (X_i - \psi)_+)^2
\end{align*}
#+END_EXPORT

\noindent which is equivalent to first minimizing
w.r.t. \(beta\), i.e. plug-in the OLS estimator:
#+BEGIN_EXPORT latex
\begin{align*}
\tilde{\beta}(\psi) &= \frac{\sum_{i=1}^n X_i Y_i - (X_i - \psi)_+ Y_i}{\sum_{i=1}^n (X_i + (X_i - \psi)_+)^2} = \frac{\sum_{i=1}^n \Ind[X_i \leq \psi] X_i Y_i}{\sum_{i=1}^n \Ind[X_i \leq \psi] X^2_i} \\
\end{align*}
#+END_EXPORT

and then minimize w.r.t. \(\psi\):
#+BEGIN_EXPORT latex
\begin{align*}
\likelihood(\psi) &= \sum_{i=1}^n (Y_i - \tilde{\beta}(\psi) X_i + \tilde{\beta}(\psi) (X_i - \psi)_+)^2
\end{align*}
#+END_EXPORT

So the first 'derivative' should solve:
#+BEGIN_EXPORT latex
\begin{align*}
0 =& -2 \sum_{i=1}^n \left[
  \frac{\partial \tilde{\beta}(\psi)}{\partial \psi} (X_i - (X_i - \psi)_+)
- \tilde{\beta}(\psi)\frac{\partial (X_i - \psi)_+}{\partial \psi}\right]
(Y_i - \tilde{\beta}(\psi) X_i + \tilde{\beta}(\psi)(X_i - \psi)_+ ) \\
0 =& \frac{\partial \tilde{\beta}(\psi)}{\partial \psi} \sum_{i=1}^n (X_i - (X_i - \psi)_+)(Y_i - \tilde{\beta}(\psi) X_i + \tilde{\beta}(\psi)(X_i - \psi)_+ ) \\
& - \tilde{\beta}(\psi)\sum_{i=1}^n\frac{\partial (X_i - \psi)_+}{\partial \psi}(Y_i - \tilde{\beta}(\psi) X_i + \tilde{\beta}(\psi)(X_i - \psi)_+ ) 
\end{align*}
#+END_EXPORT

Assuming that the breakpoint does not coincide with any datapoint:
#+BEGIN_EXPORT latex
\begin{align*}
0 =& - \tilde{\beta}(\psi)\sum_{i=1}^n \Ind[X_i \geq \psi] (Y_i - \tilde{\beta}(\psi) \psi)  \\
\frac{1}{n}\sum_{i=1}^n \Ind[X_i \geq \psi] Y_i =& \tilde{\beta}(\psi) \psi
\end{align*}
#+END_EXPORT

So the breakpoint should be such that the average post-breakpoint value equal the fitted plateau.

\clearpage

