inst/theory/breakpoint.tex

\subsection{Example}
\label{sec:org5660144}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
library(lmbreak)

set.seed(10)
df11 <- simBreak(c(1, 100), breakpoint = c(0,2,4),
                 slope = c(1,0), sigma = 0.05)
e.lmbreak11 <- lmbreak(Y ~ 0 + bp(X, pattern = "11", start = c(2)),
                       data = df11)
model.tables(e.lmbreak11)
\end{lstlisting}

\begin{verbatim}
           X duration intercept      slope
1 0.05773562 1.926807  0.000000 1.00316914
2 1.98454227 1.860667  1.932913 0.01677379
3 3.84520966       NA  1.964123         NA
\end{verbatim}


OLS:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
XX <- cbind(df11$X, pmax(df11$X-coef(e.lmbreak11),0))
solve(t(XX) %*% XX) %*% t(XX) %*% df11$Y
\end{lstlisting}

\begin{verbatim}
           [,1]
[1,]  1.0031692
[2,] -0.9863952
\end{verbatim}


Explicit OLS:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
(crossprod(XX[,2]) * crossprod(XX[,1],df11$Y) - crossprod(XX[,1],XX[,2]) * crossprod(XX[,2],df11$Y)) / (crossprod(XX[,1]) * crossprod(XX[,2]) - crossprod(XX[,1],XX[,2])^2)
(crossprod(XX[,1]) * crossprod(XX[,2],df11$Y) - crossprod(XX[,1],XX[,2]) * crossprod(XX[,1],df11$Y)) / (crossprod(XX[,1]) * crossprod(XX[,2]) - crossprod(XX[,1],XX[,2])^2)
\end{lstlisting}

\begin{verbatim}
         [,1]
[1,] 1.003169
           [,1]
[1,] -0.9863952
\end{verbatim}


Full likelihood:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
calcLogLik <- function(theta){
  beta <- theta["beta"]
  gamma <- theta["gamma"]
  psi <- theta["psi"]
  sigma <- theta["sigma"]
  as.double(-NROW(df11)/2 * log(2*pi) - NROW(df11)/2 * log(sigma) - sum((df11$Y - beta * df11$X - gamma * pmax(df11$X - psi,0))^2)/(2*sigma))
}
theta <- c(beta = unname(coef(e.lmbreak11$model)["Us0"]),
           gamma = unname(coef(e.lmbreak11$model)["Us1"]),
           psi = 1.98454227,
           sigma = sigma(e.lmbreak11$model)^2)
calcLogLik(theta = theta)
logLik(e.lmbreak11$model)
\end{lstlisting}

\begin{verbatim}
[1] 162.2538
'log Lik.' 162.2768 (df=4)
\end{verbatim}


Profile likelihood:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
calcProfLik <- function(psi){ ## psi <- 1
  XX <- cbind(df11$X, pmax(df11$X-psi,0))
  OLS <- as.double(solve(t(XX) %*% XX) %*% t(XX) %*% df11$Y)
  sigma <- sum((df11$Y - XX %*% OLS)^2)/(NROW(df11)-3)
   - NROW(df11)/2 * log(2*pi) - NROW(df11)/2 * log(sigma) - (NROW(df11)-3)/2
}
calcProfLik(theta["psi"])

df.gridPsi <- data.frame(psi = seq(0.5,3.5,length.out=1000))
df.gridPsi$logLik <- sapply(df.gridPsi$psi,calcProfLik)
ggplot(df.gridPsi, aes(x=psi,y=logLik)) + geom_line()
\end{lstlisting}

\begin{verbatim}
[1] 162.2538
\end{verbatim}



Score:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
library(numDeriv)
jacobian(calcLogLik, theta)
jacobian(calcProfLik, theta["psi"])
\end{lstlisting}
\begin{verbatim}
           [,1]        [,2]        [,3]      [,4]
[1,] 0.02242403 0.006498193 0.007915766 -638.0514
            [,1]
[1,] 0.001578588
\end{verbatim}


Hessian:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
Hall <- hessian(calcLogLik, theta)
Iall <- solve(-Hall)

Iall[3,3] - Iall[3,1:2] %*% solve(Iall[1:2,1:2]) %*% Iall[1:2,3]

Hpsi <- hessian(calcProfLik, theta["psi"])
Ipsi <- solve(-Hpsi)

Ipsi/(Iall[3,3] - Iall[3,1:2] %*% solve(Iall[1:2,1:2]) %*% Iall[1:2,3])

\end{lstlisting}

\begin{verbatim}
             [,1]
[1,] 5.740945e-05
         [,1]
[1,] 4.928297
\end{verbatim}


\clearpage

\section{Multiple breakpoints}
\label{sec:orga5dc241}

We now consider the more general case where:
\begin{align*}
Y = \beta X(\psi) + \varepsilon
\end{align*}
where \(\beta\) is a vector of coefficients and \(X(\psi)\) the design
matrix depending on a vector of breakpoint \(\psi\). Similarly to the
previous derivations we need to minimize the mean square loss:
\begin{align*}
\sum_{i=1}^n \left(Y_i - \beta X_i(\psi)\right)^2
\end{align*}

with respect to \(\beta\) and \(\psi\). For given \(\psi\) the
coefficient \(\beta\) minimizing this loss are given by the OLS
estimator:
\begin{align*}
\widehat{\beta} = (\trans{X}(\psi)X(\psi))^{-1}\trans{X}(\psi) Y
\end{align*}

\clearpage

\section{Proximal gradient method}
\label{sec:org8759e44}

One difficulty is that this objective function is not differientiable
in \(\psi\) at \(\left(X_i\right)_{i=1}^n\). 

\bigskip

\(\likelihood(\Theta_\mu)\) might not be strictly convex but it is
convex. So we can try applying a proximal gradient algorithm. This
means updating the estimate by:
\begin{align*}
\Theta_{\mu,k+1} &= \text{prox}_{\alpha_k \likelihood}(\Theta_{\mu,k}) = \argmin_{\Theta_\mu \in \Real^2} \left( \likelihood(\Theta_\mu) + \frac{1}{2\alpha_k}||\Theta_\mu-\Theta_{\mu,k}||^2 \right) \\
&= \argmin_{\Theta_\mu \in \Real^3} \left( \sum_{i=1} (Y_i - \beta X_i - \gamma (X_i - \psi)_+)^2 + \frac{(\beta - \beta_k)^2+(\gamma - \gamma_k)^2+(\psi - \psi_k)^2}{2\alpha_k} \right) 
&= \argmin_{\psi \in \Real} \left((I - Z)(\trans{Z}Z)^{-1}ZY + \frac{(\beta - \beta_k)^2+(\gamma - \gamma_k)^2+(\psi - \psi_k)^2}{2\alpha_k}  \right)
\end{align*}
where \(\alpha_k\) is a pre-defined stricly positive real value.
\end{document}